/* 타이머 만들기 실습 */

180 / 60
// 3
179 / 60
// 2.9833333333333334
75 / 60
// 1.25
const 분 = Math.floor(172 / 60)
// undefined
const 초 = 172 % 60
// undefined
분
// 2
초
// 52
분 + ":" + 초
// '2:52'

let 시간 = 180
setInterval(function(){
    const 분 = Math.floor(시간 / 60)
    const 초 = 시간 % 60
    console.log(분 + ":" + 초)
    시간 = 시간 - 1
}, 1000)
// 3
// VM7578:5 3:0
// VM7578:5 2:59
// VM7578:5 2:58
// VM7578:5 2:57
// VM7578:5 2:56
// VM7578:5 2:55
// VM7578:5 2:54
// VM7578:5 2:53
// VM7578:5 2:52
// VM7578:5 2:51
// VM7578:5 2:50
// VM7578:5 2:49
// VM7578:5 2:48
clearInterval(3)
// undefined